In [ ]:
#Ejercicio 1. Haz las importaciones necesarias para establecer la conexión y trabajar con Pandas.
#Establece la conexión usando mysql.connector 
#Utilizando try/except por si la conexión devuelve un error.

In [1]:
import mysql.connector
from mysql.connector import errorcode
import pandas as pd

In [5]:
try:
  conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost')
# en caso de que no lo consigas por que hay algún error entonces ...
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)
else:
  conexion.close()

In [8]:
# Ejercicio 2. Crea un nuevo "schema" llamado "alumnas-promo-X"
conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost')


mycursor = conexion.cursor()
try:
    mycursor.execute("CREATE SCHEMA alumnas_promo_H")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE SCHEMA alumnas_promo_H

In [12]:
# Ejercicio 3.Crea una tabla con la información de las alumnas de la promo. 
#Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono

conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',database='alumnas_promo_H')

mycursor = conexion.cursor()

try:
    mycursor.execute("CREATE TABLE info_alumnas (id_alumna INT,nombre VARCHAR (20),apellidos VARCHAR(40),ciudad VARCHAR(20),telefono CHAR(9))")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE TABLE info_alumnas (id_alumna INT..

In [19]:
# Ejercicio 4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior.

conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',database='alumnas_promo_H')

mycursor = conexion.cursor()
query = "INSERT INTO info_alumnas(id_alumna,nombre,apellidos,ciudad,telefono) VALUES(%s,%s,%s,%s,%s)"
val = [
    ('1','Sandra','Perez Gomez','Madrid','676801212'),
    ('2','Esther','Jerez Font','Granada','676828185'),
    ('3','Giselle','Monte Rios','Sevilla','676858482'),
    ('4','Hugo','Feliz Conesa','Madrid','652345678'),
    ('5','Sofia','Reyes Astorga','Cadiz','615424247'),
    ('6','Begoña','Gael Sierra','Leon','674121315'),
    ('7','Leonor','Cristal Senta','Madrid','742515656'),
    ('8','Silvia','Piñel Saez','Jaen','785451214'),
    ('9','Nuria','Cano Girones','Barcelona','689525451'),
    ('10','Belen','Santo Zambuña','Alava','643351233')
]

try:
    mycursor.executemany(query,val)
    conexion.commit()
    print(mycursor.rowcount,"registros insertados")
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

10 registros insertados

In [26]:
# Ejercicio 5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',
                              database='alumnas_promo_H')
mycursor = conexion.cursor()
mycursor.execute("SELECT * FROM info_alumnas")

consulta1 = mycursor.fetchall()

df = pd.DataFrame(consulta1, columns = ['id_alumna','nombre','apellidos','ciudad','telefono'])

conexion.close()

df

   id_alumna   nombre      apellidos     ciudad   telefono
0          1   Sandra    Perez Gomez     Madrid  676801212
1          2   Esther     Jerez Font    Granada  676828185
2          3  Giselle     Monte Rios    Sevilla  676858482
3          4     Hugo   Feliz Conesa     Madrid  652345678
4          5    Sofia  Reyes Astorga      Cadiz  615424247
5          6   Begoña    Gael Sierra       Leon  674121315
6          7   Leonor  Cristal Senta     Madrid  742515656
7          8   Silvia     Piñel Saez       Jaen  785451214
8          9    Nuria   Cano Girones  Barcelona  689525451
9         10    Belen  Santo Zambuña      Alava  643351233

In [28]:
# Ejercicio 6. Muestra los 3 primeros y tres últimos registros del Dataframe

df.head(3),df.tail(3)

(   id_alumna   nombre    apellidos   ciudad   telefono
 0          1   Sandra  Perez Gomez   Madrid  676801212
 1          2   Esther   Jerez Font  Granada  676828185
 2          3  Giselle   Monte Rios  Sevilla  676858482,
    id_alumna  nombre      apellidos     ciudad   telefono
 7          8  Silvia     Piñel Saez       Jaen  785451214
 8          9   Nuria   Cano Girones  Barcelona  689525451
 9         10   Belen  Santo Zambuña      Alava  643351233)

In [29]:
# Ejercicio 7.¿Hay registros duplicados?

df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [31]:
# Ejercicio 8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',
                              database='alumnas_promo_H')
mycursor = conexion.cursor()
mycursor.execute("SELECT ciudad FROM info_alumnas GROUP BY ciudad")

consulta2 = mycursor.fetchall()

conexion.close()

consulta2

[('Madrid',),
 ('Granada',),
 ('Sevilla',),
 ('Cadiz',),
 ('Leon',),
 ('Jaen',),
 ('Barcelona',),
 ('Alava',)]

In [40]:
# Ejercicio 9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries)

conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',
                              database='alumnas_promo_H')
mycursor = conexion.cursor()
mycursor.execute("SELECT * FROM info_alumnas WHERE ciudad='Madrid'")

consulta3 = mycursor.fetchall()

df = pd.DataFrame(consulta3, columns = ['id_alumna','nombre','apellidos','ciudad','telefono'])

conexion.close()

df

   id_alumna  nombre      apellidos  ciudad   telefono
0          1  Sandra    Perez Gomez  Madrid  676801212
1          4    Hugo   Feliz Conesa  Madrid  652345678
2          7  Leonor  Cristal Senta  Madrid  742515656

In [41]:

conexion = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',
                              database='alumnas_promo_H')
mycursor = conexion.cursor()
mycursor.execute("SELECT * FROM info_alumnas WHERE ciudad='Cadiz'")

consulta3 = mycursor.fetchall()

df = pd.DataFrame(consulta3, columns = ['id_alumna','nombre','apellidos','ciudad','telefono'])

conexion.close()

df

   id_alumna nombre      apellidos ciudad   telefono
0          5  Sofia  Reyes Astorga  Cadiz  615424247